Repository: atilasos/infantinho3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_pt

source: Tests cover model logic, view permissions, and basic interactions.
pt_pt: Os testes cobrem lógica de modelos, permissões de vistas e interações básicas.

source: Run with:
pt_pt: Executar com:

source: For more technical details, refer to the README.md file or contact the development team.
pt_pt: Para mais detalhes técnicos, consulte o ficheiro README.md ou contacte a equipa de desenvolvimento.

source: Active
pt_pt: Ativo

source: View checklist %(name)s
pt_pt: Ver checklist %(name)s

source: You have no active checklists assigned.
pt_pt: Não tem checklists ativas atribuídas.

source: Review completed checklist %(name)s
pt_pt: Rever checklist concluída %(name)s

source: You have no completed checklists.
pt_pt: Não tem checklists concluídas.

source: Invalid status provided.
pt_pt: Estado inválido fornecido.

source: Objective updated successfully!
pt_pt: Objetivo atualizado com sucesso!

source: You do not have permission to view this class checklist.
pt_pt: Não tem permissão para ver esta checklist da turma.

source: You do not have permission to modify this class checklist.
pt_pt: Não tem permissão para modificar esta checklist da turma.

source: Insufficient data to validate/rectify.
pt_pt: Dados insuficientes para validar/retificar.

source: Mark validated/rectified for {student_name}.
pt_pt: Marcar validado/retificado para {student_name}.

source: class name
pt_pt: nome da turma

source: Name of the class, e.g., "5º A", "Turma Azul".
pt_pt: Nome da turma, ex: "5º A", "Turma Azul".

source: academic year
pt_pt: ano escolar

source: Starting year of the academic year (e.g., 2024 for 2024/2025) or the grade level (e.g., 5 for 5th grade).
pt_pt: Ano de início do ano letivo (ex: 2024 para 2024/2025) ou o nível de ensino (ex: 5 para 5º ano).

source: students
pt_pt: alunos

source: teachers
pt_pt: professores

source: Classes
pt_pt: Turmas

source: Class: %(class_name)s (%(year)s)
pt_pt: Turma: %(class_name)s (%(year)s)

source: View Class Diary
pt_pt: Ver Diário da Turma

source: Teachers
pt_pt: Professores

source: No teachers assigned.
pt_pt: Não há professores atribuídos.

source: Add Student
pt_pt: Adicionar Aluno

source: General Statistics
pt_pt: Estatísticas Gerais

source: Students
pt_pt: Alunos

source: Recent Diary Posts
pt_pt: Publicações Recentes do Diário

source: last 7 days
pt_pt: últimos 7 dias

source: applicable
pt_pt: aplicável

source: Overall progress chart coming soon.
pt_pt: Gráfico de progresso geral em breve.

source: Progress Summary
pt_pt: Resumo de Progresso

source: Student Name
pt_pt: Nome do Aluno

source: Checklist Progress
pt_pt: Progresso da Checklist

source: Last Diary Post
pt_pt: Última Publicação do Diário

source: Actions
pt_pt: Ações

source: completed
pt_pt: concluído

source: View Details
pt_pt: Ver Detalhes

source: No students assigned yet.
pt_pt: Ainda não há alunos atribuídos.

source: My Classes
pt_pt: Minhas Turmas

source: You are not assigned to any classes.
pt_pt: Não está atribuído a nenhuma turma.

source: Manage Classes
pt_pt: Gerir Turmas

source: Welcome
pt_pt: Bem-vindo

source: Django Admin
pt_pt: Admin do Django

source: Nenhuma turma criada ainda.
pt_pt: Não há turmas criadas ainda.

source: Student Details
pt_pt: Detalhes do Aluno

source: in Class %(class_name)s
pt_pt: na turma %(class_name)s

source: Checklist Details
pt_pt: Detalhes da Checklist

source: Update status
pt_pt: Atualizar estado

source: Save Status
pt_pt: Guardar Estado

source: Marked Completed by Student
pt_pt: Marcado Concluído pelo Aluno

source: This checklist template currently has no items.
pt_pt: Este modelo de checklist não tem itens.

source: No checklists assigned or started for this student in this class yet.
pt_pt: Não há checklists atribuídas ou iniciadas para este aluno nesta turma ainda.

source: Individual Plan (PIT)
pt_pt: Plano Individual (PIT)

source: PIT details will appear here when implemented.
pt_pt: Detalhes do PIT aparecerão aqui quando implementado.

source: Projects
pt_pt: Projetos

source: Project involvement details will appear here when implemented.
pt_pt: Detalhes de envolvimento no projeto aparecerão aqui quando implementado.

source: Student Info
pt_pt: Informações do Aluno

source: No diary posts found for this student in this class.
pt_pt: Não há publicações no diário deste aluno nesta turma.

source: You do not have permission to view this class page.
pt_pt: Não tem permissão para ver esta página da turma.

source: Only teachers of this class or administrators can add students.
pt_pt: Apenas professores desta turma ou administradores podem adicionar alunos.

source: No user selected.
pt_pt: Nenhum usuário selecionado.

source: {user_name} promoted to student and added to the class.
pt_pt: {user_name} promovido para aluno e adicionado à turma.

source: Select Teachers
pt_pt: Selecionar Professores

source: Select one or more teachers for this class.
pt_pt: Selecione um ou mais professores para esta turma.

source: Class "{class_name}" created successfully!
pt_pt: Turma "{class_name}" criada com sucesso!

source: The requested user is not a student.
pt_pt: O usuário solicitado não é um aluno.

source: This student is not enrolled in this class.
pt_pt: Este aluno não está inscrito nesta turma.

source: You do not have permission to view this student's details.
pt_pt: Não tem permissão para ver os detalhes deste aluno.

source: You do not have permission to mark checklist items.
pt_pt: Não tem permissão para marcar itens da checklist.

source: Missing data to update checklist status.
pt_pt: Dados ausentes para atualizar o estado da checklist.

source: Checklist item '{item_code}' updated to '{status}'.
pt_pt: Item da checklist '{item_code}' atualizado para '{status}'.

source: Error updating checklist item: {}
pt_pt: Erro ao atualizar item da checklist: {}

source: An unexpected error occurred: {}
pt_pt: Um erro inesperado ocorreu: {}

source: Archived
pt_pt: Arquivado

source: start date
pt_pt: data de início

source: end date
pt_pt: data de término

source: Diary Session
pt_pt: Sessão do Diário

source: Diary Sessions
pt_pt: Sessões do Diário

source: (Active)
pt_pt: (Ativo)

source: Liked
pt_pt: Gosto

source: Disliked
pt_pt: Não Gosto

source: We Did
pt_pt: Fizemos

source: We Want
pt_pt: Queremos

source: column
pt_pt: coluna

source: Diary Entry
pt_pt: Entrada do Diário

source: Diary Entries
pt_pt: Entradas do Diário

source: Class Diary
pt_pt: Diário da Turma

source: Start New Diary Period
pt_pt: Iniciar Novo Período do Diário

source: There is currently no active diary period for this class.
pt_pt: Não há período ativo do diário para esta turma.

source: Click the button above to start a new one.
pt_pt: Clique no botão acima para iniciar um novo.

source: Diary: %(class_name)s (%(date)s)
pt_pt: Diário: %(class_name)s (%(date)s)

source: Archive & Start New Period
pt_pt: Arquivar e Iniciar Novo Período

source: Period starting: <strong>%(start_date)s</strong>
pt_pt: Início do período: <strong>%(start_date)s</strong>

source: Archived on
pt_pt: Arquivado em

source: Entry added at
pt_pt: Entrada adicionada em

source: Unknown author
pt_pt: Autor desconhecido

source: No entries yet.
pt_pt: Ainda não há entradas.

source: Add new entry...
pt_pt: Adicionar nova entrada...

source: Add Entry
pt_pt: Adicionar Entrada

source: You do not have permission to view this diary.
pt_pt: Não tem permissão para ver este diário.

source: You do not have permission to add entries to this diary.
pt_pt: Não tem permissão para adicionar entradas a este diário.

source: Cannot add entries to an archived diary session.
pt_pt: Não é possível adicionar entradas a uma sessão de diário arquivada.

source: Invalid column specified.
pt_pt: Coluna inválida especificada.

source: Content cannot be empty.
pt_pt: Conteúdo não pode estar vazio.

source: Diary entry added successfully.
pt_pt: Entrada do diário adicionada com sucesso.

source: Only teachers or admins can start/archive diary sessions.
pt_pt: Apenas professores ou administradores podem iniciar/arquivar sessões de diário.

source: Previous diary session archived.
pt_pt: Sessão anterior do diário arquivada.

source: New diary session started.
pt_pt: Nova sessão de diário iniciada.

source: You are currently logged in as <strong>%(impersonated_name)s</strong> (Impersonator: %(impersonator_name)s).
pt_pt: Está atualmente ligado como <strong>%(impersonated_name)s</strong> (Impersonador: %(impersonator_name)s).

source: Stop Impersonating
pt_pt: Terminar representação

source: Toggle navigation
pt_pt: Alternar navegação

source: Impersonating
pt_pt: A representar

source: Blog Home
pt_pt: Início do Blog

source: Create Post
pt_pt: Criar Publicação

source: Admin Tools
pt_pt: Ferramentas de Admin

source: Pending Posts
pt_pt: Publicações Pendentes

source: email address
pt_pt: endereço de email

source: role
pt_pt: função

source: The primary role of the user within the system.
pt_pt: A função principal do utilizador no sistema.

source: profile photo
pt_pt: foto de perfil

source: Optional user profile picture.
pt_pt: Foto de perfil opcional do utilizador.

source: User status, e.g., 'convidado' (guest) or 'ativo' (active).
pt_pt: Estado do utilizador, ex: 'convidado' ou 'ativo'.

source: Guests cannot have an assigned role.
pt_pt: Convidados não podem ter uma função atribuída.

source: Invalid role specified.
pt_pt: Função inválida especificada.

source: guardian
pt_pt: encarregado de educação

source: relationship
pt_pt: relação

source: e.g., Father, Mother, Legal Tutor
pt_pt: ex: Pai, Mãe, Tutor Legal

source: Guardian Relationship
pt_pt: Relação com Encarregado

source: Guardian Relationships
pt_pt: Relações com Encarregados

source: Login (Guardians & Admins)
pt_pt: Login (Encarregados de Educação e Admins)

source: Email Address
pt_pt: Endereço de Email

source: Password
pt_pt: Palavra-passe

source: Forgot password?
pt_pt: Esqueceu-se da palavra-passe?

source: Login (Students & Teachers)
pt_pt: Login (Alunos e Professores)

source: Login with Microsoft Account
pt_pt: Login com Conta Microsoft

source: Back to Login Options
pt_pt: Voltar às Opções de Login

source: Login Choice
pt_pt: Escolha de Login

source: Infantinho 3.0 Logo
pt_pt: Logótipo Infantinho 3.0

source: Select your login method:
pt_pt: Selecione o seu método de login:

source: Microsoft Account
pt_pt: Conta Microsoft

source: Students & Teachers
pt_pt: Alunos e Professores

source: Email & Password
pt_pt: Email e Palavra-passe

source: Guardians & Admins
pt_pt: Encarregados de Educação e Admins
