Repository: atilasos/infantinho3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_pt

source: Class
pt_pt: Turma

source: Select the class this post relates to.
pt_pt: Selecione a turma a que esta publicação se refere.

source: Title
pt_pt: Título

source: Content
pt_pt: Conteúdo

source: Category
pt_pt: Categoria

source: Image
pt_pt: Imagem

source: Attachment (PDF, etc.)
pt_pt: Anexo (PDF, etc.)

source: (Optional)
pt_pt: (Opcional)

source: Write a comment...
pt_pt: Escreva um comentário...

source: Your Comment
pt_pt: O seu Comentário

source: class
pt_pt: turma

source: author
pt_pt: autor

source: title
pt_pt: título

source: Optional title for the post.
pt_pt: Título opcional para a publicação.

source: content
pt_pt: conteúdo

source: image
pt_pt: imagem

source: Optional image associated with the post.
pt_pt: Imagem opcional associada à publicação.

source: attachment
pt_pt: anexo

source: Optional file attachment (e.g., PDF).
pt_pt: Anexo de ficheiro opcional (ex: PDF).

source: published at
pt_pt: publicado em

source: Pending Approval
pt_pt: Pendente de Aprovação

source: Published
pt_pt: Publicado

source: status
pt_pt: estado

source: Publication status of the post.
pt_pt: Estado de publicação do post.

source: approved by
pt_pt: aprovado por

source: User who approved the post for publication.
pt_pt: Utilizador que aprovou a publicação.

source: approved at
pt_pt: aprovado em

source: Timestamp when the post was approved.
pt_pt: Data e hora em que a publicação foi aprovada.

source: Announcement
pt_pt: Anúncio

source: Project Update
pt_pt: Atualização de Projeto

source: Student Work
pt_pt: Trabalho de Aluno

source: Other
pt_pt: Outro

source: category
pt_pt: categoria

source: The main category of the post.
pt_pt: A categoria principal da publicação.

source: removed
pt_pt: removido

source: Indicates if the post has been removed by moderation.
pt_pt: Indica se a publicação foi removida pela moderação.

source: removed by
pt_pt: removido por

source: User who removed the post.
pt_pt: Utilizador que removeu a publicação.

source: removed at
pt_pt: removido em

source: Timestamp when the post was removed.
pt_pt: Data e hora em que a publicação foi removida.

source: reason for removal
pt_pt: motivo da remoção

source: Reason provided for removing the post.
pt_pt: Motivo indicado para remover a publicação.

source: Post
pt_pt: Publicação

source: Posts
pt_pt: Publicações

source: post
pt_pt: publicação

source: Indicates if the comment has been removed by moderation.
pt_pt: Indica se o comentário foi removido pela moderação.

source: User who removed the comment.
pt_pt: Utilizador que removeu o comentário.

source: Timestamp when the comment was removed.
pt_pt: Data e hora em que o comentário foi removido.

source: Reason provided for removing the comment.
pt_pt: Motivo indicado para remover o comentário.

source: Comment
pt_pt: Comentário

source: Comments
pt_pt: Comentários

source: Comment removed by moderation
pt_pt: Comentário removido pela moderação

source: Comment by {self.autor.username} on Post {self.post_id}: '{truncated_content}'
pt_pt: Comentário de {self.autor.username} na Publicação {self.post_id}: '{truncated_content}'

source: Remove Post
pt_pt: Remover Publicação

source: Restore Post
pt_pt: Restaurar Publicação

source: Remove Comment
pt_pt: Remover Comentário

source: action
pt_pt: ação

source: The type of moderation action performed.
pt_pt: O tipo de ação de moderação realizada.

source: moderator
pt_pt: moderador

source: The user who performed the moderation action.
pt_pt: O utilizador que realizou a ação de moderação.

source: comment
pt_pt: comentário

source: timestamp
pt_pt: data/hora

source: reason
pt_pt: motivo

source: Optional reason provided by the moderator.
pt_pt: Motivo opcional fornecido pelo moderador.

source: content snapshot
pt_pt: snapshot do conteúdo

source: A snapshot of the content at the time of the action.
pt_pt: Um snapshot do conteúdo no momento da ação.

source: Moderation Log Entry
pt_pt: Entrada do Registo de Moderação

source: Moderation Log Entries
pt_pt: Entradas do Registo de Moderação

source: System
pt_pt: Sistema

source: Authentication is required.
pt_pt: Autenticação necessária.

source: Access restricted to members of this class.
pt_pt: Acesso restrito a membros desta turma.

source: Only teachers and students of this class can create posts.
pt_pt: Apenas professores e alunos desta turma podem criar publicações.

source: You do not have permission to edit this post.
pt_pt: Não tem permissão para editar esta publicação.

source: You do not have permission to remove this post.
pt_pt: Não tem permissão para remover esta publicação.

source: You do not have permission to remove this comment.
pt_pt: Não tem permissão para remover este comentário.

source: Blog/Diary
pt_pt: Blog/Diário

source: Blog/Diary Help
pt_pt: Ajuda Blog/Diário

source: Help page for the Class Blog/Diary
pt_pt: Página de ajuda para o Blog/Diário da Turma

source: Return to Blog
pt_pt: Voltar ao Blog

source: Back to Blog
pt_pt: Voltar ao Blog

source: Help sections summary
pt_pt: Resumo das secções de ajuda

source: What is it?
pt_pt: O que é?

source: How to Use
pt_pt: Como Usar

source: Roles & Permissions
pt_pt: Papéis e Permissões

source: Moderation
pt_pt: Moderação

source: What is the Blog/Diary?
pt_pt: O que é o Blog/Diário?

source: The Class Blog/Diary is a digital space where students and teachers can record activities, reflections, projects, and announcements, promoting sharing and the collective memory of the class. Each class has its own blog, accessible only to its members (students, teachers) and associated guardians.
pt_pt: O Blog/Diário da Turma é um espaço digital onde alunos e professores podem registar atividades, reflexões, projetos e anúncios, promovendo a partilha e a memória coletiva da turma. Cada turma tem o seu próprio blog, acessível apenas aos seus membros (alunos, professores) e encarregados de educação associados.

source: Create a post:
pt_pt: Criar uma publicação:

source: Click 'New Post', fill out the form, and publish. Both teachers and students can create posts.
pt_pt: Clique em 'Nova Publicação', preencha o formulário e publique. Tanto professores como alunos podem criar publicações.

source: Edit a post:
pt_pt: Editar uma publicação:

source: You can edit your own posts using the 'Edit' button on the post page (if you are the author).
pt_pt: Pode editar as suas próprias publicações usando o botão 'Editar' na página da publicação (se for o autor).

source: Remove a post:
pt_pt: Remover uma publicação:

source: Teachers and administrators can remove any post in the class using the 'Remove' button (a reason can be provided). Removed posts are hidden but can be restored.
pt_pt: Professores e administradores podem remover qualquer publicação na turma usando o botão 'Remover' (um motivo pode ser fornecido). As publicações removidas ficam ocultas mas podem ser restauradas.

source: Restore a post:
pt_pt: Restaurar uma publicação:

source: If a post was removed, teachers/admins will see a 'Restore Post' button on its page.
pt_pt: Se uma publicação foi removida, professores/administradores verão um botão 'Restaurar Publicação' na sua página.

source: Comment:
pt_pt: Comentar:

source: Use comments to provide feedback, ask questions, or share ideas. Teachers and admins can remove inappropriate comments.
pt_pt: Use os comentários para dar feedback, fazer perguntas ou partilhar ideias. Professores e administradores podem remover comentários inapropriados.

source: Filter posts:
pt_pt: Filtrar publicações:

source: Use the category and date filters at the top of the blog list to find specific posts.
pt_pt: Use os filtros de categoria e data no topo da lista do blog para encontrar publicações específicas.

source: Roles and Permissions
pt_pt: Papéis e Permissões

source: Students:
pt_pt: Alunos:

source: Can create posts, edit their own posts, and comment on posts.
pt_pt: Podem criar publicações, editar as suas próprias publicações e comentar em publicações.

source: Teachers:
pt_pt: Professores:

source: Can create posts, edit their own posts, remove any post or comment in their class, restore posts, and view moderation logs.
pt_pt: Podem criar publicações, editar as suas próprias publicações, remover qualquer publicação ou comentário na sua turma, restaurar publicações e ver os registos de moderação.

source: Guardians:
pt_pt: Encarregados de Educação:

source: Can read posts in their child's class blog and add comments.
pt_pt: Podem ler publicações no blog da turma do seu educando e adicionar comentários.

source: Administrators:
pt_pt: Administradores:

source: Have full access to all blogs, including editing, removal, restoration, and logs.
pt_pt: Têm acesso total a todos os blogs, incluindo edição, remoção, restauro e registos.

source: Moderation and Safety
pt_pt: Moderação e Segurança

source: All removal and restoration actions are logged to ensure transparency.
pt_pt: Todas as ações de remoção e restauro são registadas para garantir transparência.

source: Teachers and admins can view the moderation history via the 'View Moderation 'Log' link (visible on removed posts or potentially elsewhere).
pt_pt: Professores e administradores podem ver o histórico de moderação através do link 'Ver Registo de Moderação' (visível em publicações removidas ou potencialmente noutro local).

source: Reasons for removal can (and should) be provided for future reference.
pt_pt: Motivos para remoção podem (e devem) ser fornecidos para referência futura.

source: Removed posts/comments are initially hidden from regular view but can be restored by moderators.
pt_pt: Publicações/comentários removidos ficam inicialmente ocultos da vista normal mas podem ser restaurados pelos moderadores.

source: Confirm Comment Removal
pt_pt: Confirmar Remoção de Comentário

source: Confirm comment removal
pt_pt: Confirmar remoção de comentário

source: Are you sure you want to remove this comment? This action might be logged.
pt_pt: Tem a certeza que quer remover este comentário? Esta ação pode ser registada.

source: Publication date
pt_pt: Data de publicação

source: Comment removal form
pt_pt: Formulário de remoção de comentário

source: Reason (optional):
pt_pt: Motivo (opcional):

source: Reason for removal
pt_pt: Motivo da remoção

source: Optional: provide a reason for the moderation log.
pt_pt: Opcional: forneça um motivo para o registo de moderação.

source: Confirm removal of this comment
pt_pt: Confirmar remoção deste comentário

source: Confirm Removal
pt_pt: Confirmar Remoção

source: Cancel and return to post
pt_pt: Cancelar e voltar à publicação

source: Cancel
pt_pt: Cancelar

source: Moderation Log
pt_pt: Registo de Moderação

source: Moderation log for class blog/diary
pt_pt: Registo de moderação para o blog/diário da turma

source: Class Moderation Log
pt_pt: Registo de Moderação da Turma

source: What is this log?
pt_pt: O que é este registo?

source: This log records all moderation actions (removals, restorations) performed on posts and comments within this class blog. Only administrators and assigned teachers can view this log.
pt_pt: Este registo grava todas as ações de moderação (remoções, restauros) realizadas em publicações e comentários dentro deste blog da turma. Apenas administradores e professores associados podem ver este registo.

source: Each entry shows who performed the action, when, the reason provided (if any), and a snapshot of the content affected.
pt_pt: Cada entrada mostra quem realizou a ação, quando, o motivo fornecido (se existir) e um snapshot do conteúdo afetado.

source: Moderation log table
pt_pt: Tabela de registo de moderação

source: Date/Time
pt_pt: Data/Hora

source: Action
pt_pt: Ação

source: Moderator
pt_pt: Moderador

source: Target
pt_pt: Alvo

source: Reason
pt_pt: Motivo

source: Content Snapshot
pt_pt: Snapshot do Conteúdo

source: View details of post
pt_pt: Ver detalhes da publicação

source: View comment on post
pt_pt: Ver comentário na publicação

source: (Post Unknown)
pt_pt: (Publicação Desconhecida)

source: N/A
pt_pt: N/D

source: No moderation actions recorded yet.
pt_pt: Nenhuma ação de moderação registada ainda.

source: Confirm Post Removal
pt_pt: Confirmar Remoção da Publicação

source: Confirm post removal
pt_pt: Confirmar remoção da publicação

source: Are you sure you want to remove this post? This action might be logged.
pt_pt: Tem a certeza que quer remover esta publicação? Esta ação pode ser registada.

source: Post removal form
pt_pt: Formulário de remoção de publicação

source: Confirm removal of this post
pt_pt: Confirmar remoção desta publicação

source: (No Title)
pt_pt: (Sem Título)

source: Approve this post for publication
pt_pt: Aprovar esta publicação

source: Approve
pt_pt: Aprovar

source: Edit this post
pt_pt: Editar esta publicação

source: Edit
pt_pt: Editar

source: Remove this post
pt_pt: Remover esta publicação

source: Remove
pt_pt: Remover

source: Restore this post
pt_pt: Restaurar esta publicação

source: Post Removed
pt_pt: Publicação Removida

source: This post was removed by moderation.
pt_pt: Esta publicação foi removida pela moderação.

source: Reason:
pt_pt: Motivo:

source: Removed by:
pt_pt: Removido por:

source: (Post Image)
pt_pt: (Imagem da Publicação)

source: Attachment:
pt_pt: Anexo:

source: Are you sure you want to remove this comment?
pt_pt: Tem a certeza que quer remover este comentário?

source: Remove this comment?
pt_pt: Remover este comentário?

source: No comments yet.
pt_pt: Ainda não há comentários.

source: Add your comment
pt_pt: Adicione o seu comentário

source: Comment form
pt_pt: Formulário de comentário

source: Write your comment here...
pt_pt: Escreva o seu comentário aqui...

source: Publish comment
pt_pt: Publicar comentário

source: Post Comment
pt_pt: Publicar Comentário

source: Log in
pt_pt: Iniciar sessão

source: to add a comment.
pt_pt: para adicionar um comentário.

source: Comments can be added after the post is approved.
pt_pt: Os comentários podem ser adicionados depois da publicação ser aprovada.

source: Return to blog list
pt_pt: Voltar à lista do blog

source: Close
pt_pt: Fechar

source: Are you sure you want to remove the post "%(title)s"?
pt_pt: Tem a certeza que quer remover a publicação "%(title)s"?

source: Edit Post
pt_pt: Editar Publicação

source: New Post
pt_pt: Nova Publicação

source: Edit post form
pt_pt: Formulário de edição de publicação

source: New post form
pt_pt: Formulário de nova publicação

source: Post submission form
pt_pt: Formulário de submissão de publicação

source: Select only if category is Class Diary.
pt_pt: Selecione apenas se a categoria for Diário de Turma.

source: Help on subcategory
pt_pt: Ajuda sobre subcategoria

source: Only applicable for 'Class Diary' category.
pt_pt: Aplicável apenas para a categoria 'Diário de Turma'.

source: Currently only Internal visibility is supported.
pt_pt: Atualmente apenas a visibilidade Interna é suportada.

source: Help on visibility
pt_pt: Ajuda sobre visibilidade

source: Save Changes
pt_pt: Guardar Alterações

source: Publish Post
pt_pt: Publicar

source: Publish
pt_pt: Publicar

source: Cancel editing and return to post
pt_pt: Cancelar edição e voltar à publicação

source: Cancel and return to list
pt_pt: Cancelar e voltar à lista

source: Edit Post: %(title)s
pt_pt: Editar Publicação: %(title)s

source: Create New Post
pt_pt: Criar Nova Publicação

source: Submit Post
pt_pt: Submeter Publicação

source: Help for Blog/Diary
pt_pt: Ajuda para Blog/Diário

source: Help
pt_pt: Ajuda

source: Blog Filters
pt_pt: Filtros do Blog

source: Category:
pt_pt: Categoria:

source: Filter by category
pt_pt: Filtrar por categoria

source: All
pt_pt: Todas

source: Date:
pt_pt: Data:

source: Filter by date
pt_pt: Filtrar por data

source: Apply Filters
pt_pt: Aplicar Filtros

source: Filter
pt_pt: Filtrar

source: Clear
pt_pt: Limpar

source: View details of post: %(title)s
pt_pt: Ver detalhes da publicação: %(title)s

source: by %(author)s | %(category)s
pt_pt: por %(author)s | %(category)s

source: No posts found matching your filters.
pt_pt: Nenhuma publicação encontrada com os seus filtros.

source: No posts have been created in this blog yet.
pt_pt: Nenhuma publicação foi criada neste blog ainda.

source: Post navigation
pt_pt: Navegação de publicações

source: First
pt_pt: Primeira

source: Previous
pt_pt: Anterior

source: Next
pt_pt: Próxima

source: Last
pt_pt: Última

source: Download Attachment
pt_pt: Descarregar Anexo

source: Page %(current_page)s of %(total_pages)s
pt_pt: Página %(current_page)s de %(total_pages)s

source: No blog posts have been published yet.
pt_pt: Nenhuma publicação foi publicada ainda.

source: Pending Blog Posts
pt_pt: Publicações Pendentes

source: Posts Pending Approval
pt_pt: Publicações Pendentes de Aprovação

source: Pending
pt_pt: Pendente

source: There are no posts pending approval at this time.
pt_pt: Não há publicações pendentes de aprovação neste momento.

source: Invalid date format for filtering.
pt_pt: Formato de data inválido para filtragem.

source: You do not have permission to view this post.
pt_pt: Não tem permissão para ver esta publicação.

source: Post published successfully.
pt_pt: Publicação publicada com sucesso.

source: Post submitted for approval.
pt_pt: Publicação submetida para aprovação.

source: Please correct the errors below.
pt_pt: Por favor corrija os erros abaixo.

source: Cannot edit a removed post. Please restore it first.
pt_pt: Não é possível editar uma publicação removida. Por favor, restaure-a primeiro.

source: Post updated successfully.
pt_pt: Publicação atualizada com sucesso.

source: Post removed successfully.
pt_pt: Publicação removida com sucesso.

source: You cannot comment on this post.
pt_pt: Não pode comentar nesta publicação.

source: Comment added successfully.
pt_pt: Comentário adicionado com sucesso.

source: Could not add comment. Please check your input.
pt_pt: Não foi possível adicionar o comentário. Por favor, verifique os dados inseridos.

source: Comment removed successfully.
pt_pt: Comentário removido com sucesso.

source: Access restricted to class moderators.
pt_pt: Acesso restrito a moderadores da turma.

source: You do not have permission to restore this post.
pt_pt: Não tem permissão para restaurar esta publicação.

source: This post is already active.
pt_pt: Esta publicação já está ativa.

source: Restored by moderation
pt_pt: Restaurado pela moderação

source: Post restored successfully.
pt_pt: Publicação restaurada com sucesso.

source: You do not have permission to approve this post.
pt_pt: Não tem permissão para aprovar esta publicação.

source: Post approved and published.
pt_pt: Publicação aprovada e publicada.

source: This post is not pending approval.
pt_pt: Esta publicação não está pendente de aprovação.

source: Access restricted to teachers and administrators.
pt_pt: Acesso restrito a professores e administradores.

source: name
pt_pt: nome

source: description
pt_pt: descrição

source: Checklist Template
pt_pt: Modelo de Checklist

source: Checklist Templates
pt_pt: Modelos de Checklist

source: code
pt_pt: código

source: text
pt_pt: texto

source: order
pt_pt: ordem

source: Checklist Item
pt_pt: Item de Checklist

source: Checklist Items
pt_pt: Itens de Checklist

source: Not Started
pt_pt: Não Iniciado

source: In Progress
pt_pt: Em Progresso

source: Completed
pt_pt: Concluído

source: Validated
pt_pt: Validado

source: checklist status
pt_pt: estado da checklist

source: marked at
pt_pt: marcado em

source: teacher validated
pt_pt: validado pelo professor

source: Checklist Mark
pt_pt: Marcação de Checklist

source: Checklist Marks
pt_pt: Marcações de Checklist

source: template
pt_pt: modelo

source: student
pt_pt: aluno

source: percentage complete
pt_pt: percentagem completa

source: Automatically calculated percentage of completed items.
pt_pt: Percentagem calculada automaticamente de itens concluídos.

source: last updated
pt_pt: última atualização

source: Student Checklist Status
pt_pt: Estado da Checklist do Aluno

source: Student Checklist Statuses
pt_pt: Estados das Checklists dos Alunos

source: Checklist Detail
pt_pt: Detalhe da Checklist

source: My Checklists
pt_pt: Minhas Checklists

source: Grade
pt_pt: Ano

source: Checklist progress
pt_pt: Progresso da checklist

source: Council Focus
pt_pt: Foco do Conselho

source: Validated by Teacher
pt_pt: Validado pelo Professor

source: Agreed in Council
pt_pt: Acordado em Conselho

source: Criteria:
pt_pt: Critérios:

source: Comment (optional)
pt_pt: Comentário (opcional)

source: Save changes for this item
pt_pt: Guardar alterações para este item

source: Save
pt_pt: Guardar

source: Back to My Checklists
pt_pt: Voltar às Minhas Checklists

source: Congratulations, you have completed all objectives in this list!
pt_pt: Parabéns, completou todos os objetivos desta lista!

source: Class Overview
pt_pt: Visão Geral da Turma

source: Class Overview: %(name)s
pt_pt: Visão Geral da Turma: %(name)s

source: Back to Class
pt_pt: Voltar à Turma

source: Class: %(name)s (%(year)s)
pt_pt: Turma: %(name)s (%(year)s)

source: Overall Class Progress:
pt_pt: Progresso Geral da Turma:

source: Overall class progress
pt_pt: Progresso geral da turma

source: Class checklist progress table
pt_pt: Tabela de progresso da checklist da turma

source: Student
pt_pt: Aluno

source: Student progress
pt_pt: Progresso do aluno

source: Validate this completion
pt_pt: Validar esta conclusão

source: Change status or add comment
pt_pt: Alterar estado ou adicionar comentário

source: Status:
pt_pt: Estado:

source: No students in this class.
pt_pt: Nenhum aluno nesta turma.

source: Checklists Documentation
pt_pt: Documentação das Checklists

source: Checklists Module - Technical Overview
pt_pt: Módulo de Checklists - Visão Técnica

source: Brief documentation for developers regarding the Checklists module.
pt_pt: Documentação breve para programadores sobre o módulo Checklists.

source: Core Models
pt_pt: Modelos Principais

source: Admin Interface
pt_pt: Interface de Administração

source: Checklist Templates and their Items can be managed via the Django Admin interface (/admin/). Items are managed inline within their respective Template.
pt_pt: Modelos de Checklist e os seus Itens podem ser geridos através da interface de Administração do Django (/admin/). Os itens são geridos inline dentro do seu respetivo Modelo.

source: URL Endpoints (under /checklists/)
pt_pt: Endpoints URL (em /checklists/)

source: (my_checklists)
pt_pt: (minhas_checklists)

source: Lists checklists for the logged-in student.
pt_pt: Lista as checklists para o aluno autenticado.

source: (checklist_detail)
pt_pt: (detalhe_checklist)

source: Detail and marking page for a student.
pt_pt: Página de detalhe e marcação para um aluno.

source: Class overview grid for teachers/admins.
pt_pt: Grelha de visão geral da turma para professores/admins.

source: Basic Usage Summary
pt_pt: Resumo de Utilização Básica

source: Student:
pt_pt: Aluno:

source: Marks objectives, adds comments, tracks progress via 'My Checklists'.
pt_pt: Marca objetivos, adiciona comentários, acompanha o progresso via 'Minhas Checklists'.

source: Teacher:
pt_pt: Professor:

source: Views class overview, validates/rectifies marks, tracks collective and individual progress.
pt_pt: Vê a visão geral da turma, valida/retifica marcas, acompanha o progresso coletivo e individual.

source: Admin/Teacher:
pt_pt: Admin/Professor:

source: Manages Checklist Templates and Items via the Admin interface.
pt_pt: Gere Modelos de Checklist e Itens através da interface de Administração.

source: Automated Tests
pt_pt: Testes Automatizados
